---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.ReverseIterator
source: html/fbda471e-2e84-0263-89c3-ff21d6b96115.htm
---
# Autodesk.Revit.DB.PlanTopologySet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PlanTopologySetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.